base/Documents/АктИнвентаризацииСАТУРН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктИнвентаризацииСАТУРН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>InformationRegister.МестаХраненияПартийСАТУРН</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиПартийСАТУРН</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияСАТУРН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеАктИнвентаризацииСАТУРН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПАТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторПАТСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмеряемойВеличиныСАТУРН</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыИзмеряемыхВеличинСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВУпаковкеСАТУРН</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоВУпаковкеСАТУРН</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОстатокСАТУРН</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоСАТУРН</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаРасхождения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПартии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговоеНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АртикулПроизводителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Documents/ЗапросОстатковПартийСАТУРН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗапросОстатковПартийСАТУРН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>InformationRegister.МестаХраненияПартийСАТУРН</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиПартийСАТУРН</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОрганизацияСАТУРН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗапросОстатковПартийСАТУРН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОстаткиПоДаннымСАТУРН</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХраненияСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОстатокСАТУРН</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоСАТУРН</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмеряемойВеличиныСАТУРН</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыИзмеряемыхВеличинСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПАТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторПАТСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КорректировкаОстатков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХраненияСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСАТУРН</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоСАТУРН</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВОбработкеСАТУРН</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоСАТУРН</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/CommonModules/ЗаполнениеОбъектовПоСтатистикеСАТУРН/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Заполнение документа АктИнвентаризацииСАТУРН по статистике
// Параметры:
//  ОрганизацияСАТУРН - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//
// Возвращаемое значение:
//	Структура - данные заполнения:
//  * ОрганизацияСАТУРН - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//  * МестоХранения     - СправочникСсылка.МестаХраненияСАТУРН
Функция ДанныеЗаполненияАктИнвентаризацииСАТУРН(ОрганизацияСАТУРН) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 3
	|	1                          КАК Количество,
	|	Документ.ОрганизацияСАТУРН КАК ОрганизацияСАТУРН,
	|	Документ.МестоХранения     КАК МестоХранения
	|ИЗ
	|	Документ.АктИнвентаризацииСАТУРН КАК Документ
	|ГДЕ
	|	(Документ.ОрганизацияСАТУРН = &ОрганизацияСАТУРН Или &БезУчетаОрганизации)
	|	И Документ.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("ОрганизацияСАТУРН",   ОрганизацияСАТУРН);
	Запрос.УстановитьПараметр("БезУчетаОрганизации", Не ЗначениеЗаполнено(ОрганизацияСАТУРН));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоследнихДокументов = РезультатЗапроса.Выгрузить();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ОрганизацияСАТУРН", ОрганизацияСАТУРН(ДанныеПоследнихДокументов));
	ДанныеЗаполнения.Вставить("МестоХранения",     Справочники.МестаХраненияСАТУРН.ПустаяСсылка());
	
	ЗаполнитьПоСтатистике("МестоХранения", ДанныеЗаполнения, ДанныеПоследнихДокументов);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Заполнение документа ПроизводственнаяОперацияСАТУРН по статистике
// Параметры:
//  ОрганизацияСАТУРН - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//
// Возвращаемое значение:
//	Структура - данные заполнения:
//  * ОрганизацияСАТУРН - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//  * МестоХранения     - СправочникСсылка.МестаХраненияСАТУРН
Функция ДанныеЗаполненияПроизводственнаяОперацияСАТУРН(ОрганизацияСАТУРН) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 3
	|	1                          КАК Количество,
	|	Документ.ОрганизацияСАТУРН КАК ОрганизацияСАТУРН,
	|	Документ.МестоХранения     КАК МестоХранения
	|ИЗ
	|	Документ.ПроизводственнаяОперацияСАТУРН КАК Документ
	|ГДЕ
	|	(Документ.ОрганизацияСАТУРН = &ОрганизацияСАТУРН Или &БезУчетаОрганизации)
	|	И Документ.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("ОрганизацияСАТУРН",   ОрганизацияСАТУРН);
	Запрос.УстановитьПараметр("БезУчетаОрганизации", Не ЗначениеЗаполнено(ОрганизацияСАТУРН));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоследнихДокументов = РезультатЗапроса.Выгрузить();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ОрганизацияСАТУРН", ОрганизацияСАТУРН(ДанныеПоследнихДокументов));
	ДанныеЗаполнения.Вставить("МестоХранения",     Справочники.МестаХраненияСАТУРН.ПустаяСсылка());
	
	ЗаполнитьПоСтатистике("МестоХранения", ДанныеЗаполнения, ДанныеПоследнихДокументов);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Заполнение документа ЗапросОстатковПартийСАТУРН по статистике
// Параметры:
//  ОрганизацияСАТУРН - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//
// Возвращаемое значение:
//	Структура - данные заполнения:
//  * ОрганизацияСАТУРН - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//  * МестоХранения     - СправочникСсылка.МестаХраненияСАТУРН
Функция ДанныеЗаполненияЗапросаОстатковСАТУРН(ОрганизацияСАТУРН) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 3
	|	1                          КАК Количество,
	|	Документ.ОрганизацияСАТУРН КАК ОрганизацияСАТУРН,
	|	Документ.МестоХранения     КАК МестоХранения
	|ИЗ
	|	Документ.ЗапросОстатковПартийСАТУРН КАК Документ
	|ГДЕ
	|	(Документ.ОрганизацияСАТУРН = &ОрганизацияСАТУРН Или &БезУчетаОрганизации)
	|	И Документ.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("ОрганизацияСАТУРН",   ОрганизацияСАТУРН);
	Запрос.УстановитьПараметр("БезУчетаОрганизации", Не ЗначениеЗаполнено(ОрганизацияСАТУРН));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоследнихДокументов = РезультатЗапроса.Выгрузить();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ОрганизацияСАТУРН", ОрганизацияСАТУРН(ДанныеПоследнихДокументов));
	ДанныеЗаполнения.Вставить("МестоХранения",     Справочники.МестаХраненияСАТУРН.ПустаяСсылка());
	
	ЗаполнитьПоСтатистике("МестоХранения", ДанныеЗаполнения, ДанныеПоследнихДокументов);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Заполнение документа НакладнаяСАТУРН по статистике
// Параметры:
//  ОрганизацияСАТУРН - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//  ГрузополучательОрганизацияСАТУРН - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//
// Возвращаемое значение:
//	Структура - данные заполнения:
//  * ГрузоотправительОрганизацияСАТУРН - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//  * ГрузоотправительМестоХранения     - СправочникСсылка.МестаХраненияСАТУРН
//  * ГрузополучательОрганизацияСАТУРН  - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//  * ГрузополучательМестоХранения      - СправочникСсылка.МестаХраненияСАТУРН
//  * Операция                          - ПеречислениеСсылка.ВидыОперацийСАТУРН
Функция ДанныеЗаполненияНакладнаяСАТУРН(ОрганизацияСАТУРН, ГрузополучательОрганизацияСАТУРН) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 3
	|	1                                          КАК Количество,
	|	Документ.Операция                          КАК Операция,
	|	Документ.ГрузоотправительОрганизацияСАТУРН КАК ОрганизацияСАТУРН,
	|	Документ.ГрузоотправительМестоХранения     КАК ГрузоотправительМестоХранения,
	|	Документ.ГрузополучательОрганизацияСАТУРН  КАК ГрузополучательОрганизацияСАТУРН,
	|	Документ.ГрузополучательМестоХранения      КАК ГрузополучательМестоХранения
	|ИЗ
	|	Документ.НакладнаяСАТУРН КАК Документ
	|ГДЕ
	|	(Документ.ГрузоотправительОрганизацияСАТУРН = &ОрганизацияСАТУРН Или &БезУчетаОрганизации)
	|	И (Документ.ГрузополучательОрганизацияСАТУРН = &ГрузополучательОрганизацияСАТУРН Или &БезУчетаГрузополучателя)
	|	И Документ.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("ОрганизацияСАТУРН",   ОрганизацияСАТУРН);
	Запрос.УстановитьПараметр("БезУчетаОрганизации", Не ЗначениеЗаполнено(ОрганизацияСАТУРН));
	
	Запрос.УстановитьПараметр("ГрузополучательОрганизацияСАТУРН", ГрузополучательОрганизацияСАТУРН);
	Запрос.УстановитьПараметр("БезУчетаГрузополучателя",          Не ЗначениеЗаполнено(ГрузополучательОрганизацияСАТУРН));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоследнихДокументов = РезультатЗапроса.Выгрузить();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ГрузоотправительОрганизацияСАТУРН", ОрганизацияСАТУРН(ДанныеПоследнихДокументов));
	ДанныеЗаполнения.Вставить("ГрузоотправительМестоХранения",     Справочники.МестаХраненияСАТУРН.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("ГрузополучательОрганизацияСАТУРН",  Справочники.КлассификаторОрганизацийСАТУРН.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("ГрузополучательМестоХранения",      Справочники.МестаХраненияСАТУРН.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("Операция",                          Перечисления.ВидыОперацийСАТУРН.ПустаяСсылка());
	
	ДанныеПоследнихДокументов.Колонки["ОрганизацияСАТУРН"].Имя = "ГрузоотправительОрганизацияСАТУРН";
	
	Если ЗначениеЗаполнено(ГрузополучательОрганизацияСАТУРН) Тогда
		ЗаполнитьПоСтатистике(
			"ГрузоотправительМестоХранения, Операция",
			ДанныеЗаполнения,
			ДанныеПоследнихДокументов,
			"ГрузоотправительОрганизацияСАТУРН");
		ЗаполнитьПоСтатистике(
			"ГрузополучательМестоХранения",
			ДанныеЗаполнения,
			ДанныеПоследнихДокументов,
			"ГрузоотправительОрганизацияСАТУРН, ГрузополучательОрганизацияСАТУРН");
	Иначе
		ЗаполнитьПоСтатистике(
			"ГрузоотправительМестоХранения, ГрузополучательОрганизацияСАТУРН, ГрузополучательМестоХранения, Операция",
			ДанныеЗаполнения,
			ДанныеПоследнихДокументов,
		"ГрузоотправительОрганизацияСАТУРН");
	КонецЕсли;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Заполнение документа ПланПримененияСАТУРН по статистике
// Параметры:
//  ОрганизацияСАТУРН - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//
// Возвращаемое значение:
//	Структура - данные заполнения:
//  * ОрганизацияСАТУРН  - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//  * СрокОграничений    - Строка
//  * СпособПримененияПАТ - ПеречислениеСсылка.СпособыПримененияПАТСАТУРН
Функция ДанныеЗаполненияПланПримененияСАТУРН(ОрганизацияСАТУРН) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 3
	|	1                            КАК Количество,
	|	Документ.ОрганизацияСАТУРН   КАК ОрганизацияСАТУРН,
	|	Документ.СрокОграничений     КАК СрокОграничений,
	|	Документ.СпособПримененияПАТ КАК СпособПримененияПАТ
	|ИЗ
	|	Документ.ПланПримененияСАТУРН КАК Документ
	|ГДЕ
	|	(Документ.ОрганизацияСАТУРН = &ОрганизацияСАТУРН Или &БезУчетаОрганизации)
	|	И Документ.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("ОрганизацияСАТУРН",   ОрганизацияСАТУРН);
	Запрос.УстановитьПараметр("БезУчетаОрганизации", Не ЗначениеЗаполнено(ОрганизацияСАТУРН));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоследнихДокументов = РезультатЗапроса.Выгрузить();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ОрганизацияСАТУРН",   ОрганизацияСАТУРН(ДанныеПоследнихДокументов));
	ДанныеЗаполнения.Вставить("СрокОграничений",     "");
	ДанныеЗаполнения.Вставить("СпособПримененияПАТ", Перечисления.СпособыПримененияПАТСАТУРН.ПустаяСсылка());
	
	ЗаполнитьПоСтатистике("СрокОграничений, СпособПримененияПАТ", ДанныеЗаполнения, ДанныеПоследнихДокументов);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Заполнение документа АктПримененияСАТУРН по статистике
// Параметры:
//  ОрганизацияСАТУРН - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//
// Возвращаемое значение:
//	Структура - данные заполнения:
//  * ОрганизацияСАТУРН  - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//  * МестоХранения       - СправочникСсылка.МестаХраненияСАТУРН
//  * СпособПримененияПАТ - ПеречислениеСсылка.СпособыПримененияПАТСАТУРН
Функция ДанныеЗаполненияАктПримененияСАТУРН(ОрганизацияСАТУРН) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 3
	|	1                            КАК Количество,
	|	Документ.ОрганизацияСАТУРН   КАК ОрганизацияСАТУРН,
	|	Документ.СпособПримененияПАТ КАК СпособПримененияПАТ,
	|	Документ.МестоХранения       КАК МестоХранения
	|ИЗ
	|	Документ.АктПримененияСАТУРН КАК Документ
	|ГДЕ
	|	(Документ.ОрганизацияСАТУРН = &ОрганизацияСАТУРН Или &БезУчетаОрганизации)
	|	И Документ.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("ОрганизацияСАТУРН",   ОрганизацияСАТУРН);
	Запрос.УстановитьПараметр("БезУчетаОрганизации", Не ЗначениеЗаполнено(ОрганизацияСАТУРН));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоследнихДокументов = РезультатЗапроса.Выгрузить();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ОрганизацияСАТУРН",   ОрганизацияСАТУРН(ДанныеПоследнихДокументов));
	ДанныеЗаполнения.Вставить("МестоХранения",       Справочники.МестаХраненияСАТУРН.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("СпособПримененияПАТ", Перечисления.СпособыПримененияПАТСАТУРН.ПустаяСсылка());
	
	ЗаполнитьПоСтатистике("МестоХранения,СпособПримененияПАТ", ДанныеЗаполнения, ДанныеПоследнихДокументов);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Заполнение документа ИмпортПродукцииСАТУРН по статистике
// Параметры:
//  ОрганизацияСАТУРН - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//
// Возвращаемое значение:
//	Структура - данные заполнения:
//  * ОрганизацияСАТУРН  - СправочникСсылка.КлассификаторОрганизацийСАТУРН
//  * МестоХранения       - СправочникСсылка.МестаХраненияСАТУРН
Функция ДанныеЗаполненияИмпортПродукцииСАТУРН(ОрганизацияСАТУРН) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 3
	|	1                            КАК Количество,
	|	Документ.ОрганизацияСАТУРН   КАК ОрганизацияСАТУРН,
	|	Документ.МестоХранения       КАК МестоХранения
	|ИЗ
	|	Документ.ИмпортПродукцииСАТУРН КАК Документ
	|ГДЕ
	|	(Документ.ОрганизацияСАТУРН = &ОрганизацияСАТУРН Или &БезУчетаОрганизации)
	|	И Документ.Проведен
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ");
	
	Запрос.УстановитьПараметр("ОрганизацияСАТУРН",   ОрганизацияСАТУРН);
	Запрос.УстановитьПараметр("БезУчетаОрганизации", Не ЗначениеЗаполнено(ОрганизацияСАТУРН));
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеПоследнихДокументов = РезультатЗапроса.Выгрузить();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ОрганизацияСАТУРН",   ОрганизацияСАТУРН(ДанныеПоследнихДокументов));
	ДанныеЗаполнения.Вставить("МестоХранения",       Справочники.МестаХраненияСАТУРН.ПустаяСсылка());
	
	ЗаполнитьПоСтатистике("МестоХранения", ДанныеЗаполнения, ДанныеПоследнихДокументов);
	
	Возврат ДанныеЗаполнения;

КонецФункции

Процедура ЗаполнитьПустойРеквизит(Объект, ДанныеСтатистики, ИмяРеквизита) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект[ИмяРеквизита])
		Или ТипЗнч(Объект[ИмяРеквизита]) = Тип("Булево") Тогда
		Объект[ИмяРеквизита] = ДанныеСтатистики[ИмяРеквизита];
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоСтатистике(Поля, ДанныеЗаполнения, ДанныеПоследнихДокументов, ПоляОтбора = "ОрганизацияСАТУРН")
	
	Отбор = Новый Структура;
	ОтбираемыеПоля = СтрРазделить(ПоляОтбора, ",");
	
	Для Каждого ПолеОтбора Из ОтбираемыеПоля Цикл
		ИмяПоля = СокрЛП(ПолеОтбора);
		Если ДанныеЗаполнения[ИмяПоля] <> Неопределено Тогда
			Отбор.Вставить(ИмяПоля, ДанныеЗаполнения[ИмяПоля]);
		КонецЕсли;
	КонецЦикла;
	
	Если Отбор.Количество() = 0 Тогда
		Отбор = Неопределено;
	КонецЕсли;
	
	ЗаполняемыеПоля = СтрРазделить(Поля, ",");
	
	РезультатыАнализа = ДанныеПоследнихДокументов.Скопировать(
		Отбор, Поля + ", Количество");
	
	РезультатыАнализа.Свернуть(Поля, "Количество");
	РезультатыАнализа.Сортировать("Количество Убыв");
	Если РезультатыАнализа.Количество() > 0 Тогда
		Для Каждого Поле Из ЗаполняемыеПоля Цикл
			ИмяПоля = СокрЛП(Поле);
			ДанныеЗаполнения[ИмяПоля] = РезультатыАнализа[0][ИмяПоля];
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ОрганизацияСАТУРН(ДанныеПоследнихДокументов)
	
	ДанныеАнализа = ДанныеПоследнихДокументов.Скопировать(,"ОрганизацияСАТУРН, Количество");
	ДанныеАнализа.Свернуть("ОрганизацияСАТУРН", "Количество");
	ДанныеАнализа.Сортировать("Количество Убыв");
	Если ДанныеАнализа.Количество() = 0 Тогда
		Возврат Справочники.КлассификаторОрганизацийСАТУРН.ПустаяСсылка();
	Иначе
		Возврат ДанныеАнализа[0].ОрганизацияСАТУРН;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
